In [1]:
import pandas as pd

<ipython-input-1-7dd3504c366f>:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                    'col2':[444,555,666,444],
                    'col3':['abc','def','ghi','xyz']})

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique() #selecao de dados unicos

array([444, 555, 666], dtype=int64)

In [5]:
import numpy as np

In [6]:
np.unique(df['col2']) # a forma que seria no numpy

array([444, 555, 666], dtype=int64)

In [7]:
len(df['col2'].unique()) #tamanho da coluna com elementos únicos no Numpy

3

In [8]:
df['col2'].nunique() #tamanho da coluna com elementos únicos no Pandas

3

In [9]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [12]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [16]:
def vezes2(x):
    return x*2 #funcoes que eu mesmo defini e aplicar

In [17]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [19]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [21]:
df['col1'].apply(lambda x:x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [22]:
del df['col2']

In [23]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [24]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [25]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [26]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
df.sort_values(by='col1', inplace = False) #se quisermos que fique ordenado sempre, precisa colocar True

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [30]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [31]:
df.isnull() #valores nulos

    col1   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [32]:
df.dropna() #apaga valor nulo

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [33]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                    'col2':[np.nan,555,666,444],
                    'col3':['abc','def','ghi','xyz']})

In [34]:
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [36]:
df['col1'].fillna(value=df['col1'].mean()) #prencher valor vazio da coluna 1 com a media dos valores, se quiser deixar essa alteracao permanente precisa colocar o Inplace = True

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [37]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [44]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
                    'B':['one','one','two','two','one','one'],
                    'C':['x','y','x','y','x','y'],
                    'D':[1,3,2,5,4,1]}

In [45]:
df = pd.DataFrame(data)

In [46]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
df.pivot_table(values='D', index=['A','B'], columns=['C']) #Reajustou os dados e criou um indice multinivel, similiar as tabelas dinamicas do excel

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN